# print('hello, what is your name?')
# name = input()
# print('hello '+name+', how old are you')
# age = int(input())
# age = age + 1
# print('you will be 20 in ', age, ' years.')

# LISTS     0     1      2       |---------------3----------|
# lst = ['Elias', 11, 31.877465, [12, 'закуска', 'vodka', 14]]

'''Жители страны Малевии часто экспериментируют с планировкой комнат.
Комнаты бывают треугольные, прямоугольные и круглые.
Чтобы быстро вычислять жилплощадь, требуется написать программу,
на вход которой подаётся тип фигуры комнаты и соответствующие параметры,
которая бы выводила площадь получившейся комнаты.
Для числа π в стране Малевии используют значение 3.14.'''

