'''
https://pythontutor.ru/lessons/functions/#section_1
Функции — это такие участки кода, которые изолированы от остальный программы и выполняются только тогда, когда вызываются.
Вы уже встречались с функциями sqrt(), len() и print().
Они все обладают общим свойством: они могут принимать параметры (ноль, один или несколько),
и они могут возвращать значение (хотя могут и не возвращать).
Например, функция sqrt() принимает один параметр и возвращает значение (корень числа).
'''

























