"""
Жители страны Малевии часто экспериментируют с планировкой комнат.
Комнаты бывают треугольные, прямоугольные и круглые.
Чтобы быстро вычислять жилплощадь, требуется написать программу,
на вход которой подаётся тип фигуры комнаты и соответствующие параметры,
которая бы выводила площадь получившейся комнаты.
Для числа π в стране Малевии используют значение 3.14.
"""



# =================================================================================



"""
GC-состав является важной характеристикой геномных последовательностей 
и определяется как процентное соотношение суммы всех гуанинов и цитозинов 
к общему числу нуклеиновых оснований в геномной последовательности.
Напишите программу, которая вычисляет процентное содержание символов 
G (гуанин) и C (цитозин) в введенной строке (программа не должна зависеть от регистра вводимых символов).
Например, в строке "acggtgttat" процентное содержание символов G и C 
равно 4/10*100 = 40.0 где 4 - это количество символов G и C, а 10 - это длина строки.
"""